[
  {
    "categoryId": 1,
    "productId": 1,
    "name": "Miso Soup",
    "description": "The most common dashi soup stocks for miso soup are made of niboshi (dried baby sardines), kombu (dried kelp), katsuobushi (thin shavings of dried and smoked bonito, aka skipjack tuna), or hoshi-shiitake (dried shiitake).",
    "image": null,
    "basePrice": 1.25
  },
  {
    "categoryId": 1,
    "productId": 2,
    "name": "Green Salad",
    "description": "A green salad or garden salad is most often composed of leafy vegetables such as lettuce varieties, spinach, or rocket (arugula). If non-greens make up a large portion of the salad it may be called a vegetable salad instead of a green salad.",
    "image": null,
    "basePrice": 3.75
  },
  {
    "categoryId": 1,
    "productId": 3,
    "name": "Seafood Salad",
    "description": "Crab Salad with celery and mayonnaise is a delicious and inexpensive delicious way to enjoy the classic Seafood Salad we all grew up with",
    "image": null,
    "basePrice": 6
  },
  {
    "categoryId": 2,
    "productId": 4,
    "name": "Wakame",
    "description": "Wakame is a thin and stringy sea vegetable, more commonly known as seaweed, deep green in color and used in making seaweed salad and miso soup",
    "image": null,
    "basePrice": 3.5
  },
  {
    "categoryId": 2,
    "productId": 5,
    "name": "Veggie Sunomono",
    "description": "Sunomono is a Japanese cucumber salad served at the beginning of meals. It's made of marinated cucumber slices topped with sesame seeds. It can be served with a thin, vinegar-based sauce such as Amazu sauce or Ponzu sauce, or with a simple sauce made of just vinegar and sugar.",
    "image": null,
    "basePrice": 3
  },
  {
    "categoryId": 2,
    "productId": 6,
    "name": "Gomae",
    "description": "Gomae is a Japanese side dish. It is made with vegetables and sesame dressing",
    "image": null,
    "basePrice": 3.5
  },
  {
    "categoryId": 2,
    "productId": 7,
    "name": "Gyoza",
    "description": "Gyoza are dumplings filled with ground meat and vegetables and wrapped in a thin dough. ",
    "image": null,
    "basePrice": 3.75
  },
  {
    "categoryId": 3,
    "productId": 8,
    "name": "Agedashi Tofu",
    "description": "Agedashi Tofu is one of those magical dishes where a few simple ingredients come together in a harmonizing synergy that elevates the dish from humble to divine.",
    "image": null,
    "basePrice": 3.5
  },
  {
    "categoryId": 3,
    "productId": 9,
    "name": "Chicken Karaage",
    "description": "Japanese fried chicken is made by marinating bite-size pieces of chicken in sake, soy sauce, ginger and garlic before coating them generously with potato starch.",
    "image": null,
    "basePrice": 3.95
  },
  {
    "categoryId": 3,
    "productId": 10,
    "name": "Ika karaage",
    "description": "Deep fried squid",
    "image": null,
    "basePrice": 4.95
  },
  {
    "categoryId": 3,
    "productId": 11,
    "name": "Takoyaki",
    "description": "Takoyaki is a ball-shaped Japanese snack made of a wheat flour-based batter and cooked in a special molded pan. It is typically filled with minced or diced octopus (tako), tempura scraps (tenkasu), pickled ginger, and green onion",
    "image": null,
    "basePrice": 3.95
  }
]